org-ref.el

(defun org-ref-get-bibtex-key-under-cursor ()
  "returns key under the bibtex cursor. We search forward from
point to get a comma, or the end of the link, and then backwards
to get a comma, or the beginning of the link. that delimits the
keyword we clicked on. We also strip the text properties."
  (interactive)
  (let* ((object (org-element-context))	 
	 (link-string (org-element-property :path object)))    
    (when (and (equal (org-element-type object) 'link) 
               (equal (org-element-property :type object) "cite"))
      ;; we need the link path start and end
      (save-excursion
	(goto-char (org-element-property :begin object))
	(search-forward link-string nil nil 1)
	(setq link-string-beginning (match-beginning 0))
	(setq link-string-end (match-end 0)))

      ;; The key is the text between commas, or the link boundaries
      (save-excursion
	(if (search-forward "," link-string-end t 1)
	    (setq key-end (- (match-end 0) 1)) ; we found a match
	  (setq key-end link-string-end))) ; no comma found so take the end
      ;; and backward to previous comma from point which defines the start character
      (save-excursion
	(if (search-backward "," link-string-beginning 1 1)
	    (setq key-beginning (+ (match-beginning 0) 1)) ; we found a match
	  (setq key-beginning link-string-beginning))) ; no match found
      ;; save the key we clicked on.
      (setq bibtex-key (org-ref-strip-string (buffer-substring key-beginning key-end)))
      (set-text-properties 0 (length bibtex-key) nil bibtex-key)
      (message "you selected %s" bibtex-key)
      bibtex-key
      )))

(defun org-ref-find-bibliography ()
  "find the bibliography in the buffer.
This function sets and returns cite-bibliography-files, which is a list of files
either from bibliography:f1.bib,f2.bib
\bibliography{f1,f2}
internal bibliographies

falling back to what the user has set in org-ref-default-bibliography
"
  (interactive)
  (save-excursion
    (goto-char (point-min))
    ;;  look for a bibliography link
    (re-search-forward "bibliography:\\([^\]\|\n]+\\)" nil t)
    (if (match-string 1) ; we found a link
	(progn
	  (setq org-ref-bibliography-files
		(mapcar 'org-ref-strip-string (split-string (match-string 1) ",")))
	  (message "org-ref-bibliography-files = %s from %s" org-ref-bibliography-files (match-string 1)))
      (progn ;we did not find a bibliography link. now look for \bibliography
	(message "no bibliography link found")
	(goto-char (point-min))
	(re-search-forward "\\\\bibliography{\\([^}]+\\)}" nil t)
	(if (match-string 1) ; we found a link
	    ;; split, and add .bib to each file
	    (setq org-ref-bibliography-files
		  (mapcar (lambda (x) (concat x ".bib"))
			  (mapcar 'org-ref-strip-string 
				  (split-string (match-string 1) ","))))
	 ; we did not find a raw latex bibliography. use defaults
	  (setq org-ref-bibliography-files org-ref-default-bibliography)
	  (message "org-ref-bibliography-files = %s" org-ref-bibliography-files)))))
  (message "org-ref-bibliography-files = %s" org-ref-bibliography-files)
  ;; set reftex-default-bibliography so we can search
  (set (make-local-variable 'reftex-default-bibliography) org-ref-bibliography-files)
  org-ref-bibliography-files)

(defun org-ref-key-in-file-p (key filename)
  "determine if the key is in the file"
  (with-temp-buffer
    (insert-file-contents filename)
    (bibtex-search-entry key)))

(defun org-ref-get-bibtex-key-and-file ()
  "returns the bibtex key and file that it is in under point"
 (interactive)

 (let ((org-ref-bibliography-files (org-ref-find-bibliography))
       key file)
   (setq key (org-ref-get-bibtex-key-under-cursor))
   (setq file     (loop for file in org-ref-bibliography-files do
			    (if (org-ref-key-in-file-p key file) 
				(return file))))
   (message  "you found %s in %s" key file)
   (cons key file)))

(defun org-ref-get-menu-options ()
  "returns a dynamically determined string of options for the citation under point.

we check to see if there is pdf, and if the key actually exists in the bibliography"
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
	 (key (car results))
	 (cb (current-buffer))
         (pdf-file (format (concat org-ref-pdf-directory "%s.pdf") key))
         (bibfile (cdr results))
	 m1 m2 m3 m4 m5 menu-string)
    (setq m1 (if bibfile		 
		 "(o)pen"
	       "(No key found)"))

    (setq m3 (if (file-exists-p pdf-file)
		 "(p)df"
		     "(No pdf found)"))

    (setq m4 "(u)rl")
    (setq m5 "(n)otes")
    (setq m2 (if bibfile
		 (progn
		   (let ((cb (current-buffer)) citation)
		     (setq citation (progn
				      (set-buffer (find-file-noselect bibfile))
				      (bibtex-search-entry key)  
				      (org-ref-bib-citation)))
		     (set-buffer cb)
		     citation))
	       "no key found"))

    (setq menu-string (mapconcat 'identity (list m2 "\n" m1 m3 m4 m5 "(q)uit") "  "))
    (message "%s" menu-string)
    menu-string))

(defun org-ref-open-pdf-at-point ()
  "open the pdf for bibtex key under point if it exists"
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
	 (key (car results))
         (pdf-file (format (concat org-ref-pdf-directory "%s.pdf") key)))
    (if (file-exists-p pdf-file)
	(org-open-file pdf-file)
(message "no pdf found for %s" key))))


(defun org-ref-open-url-at-point ()
  "open the url for bibtex key under point."
  (interactive)
  (let* ((cb (current-buffer))
	 (results (org-ref-get-bibtex-key-and-file))
	 (key (car results))
	 (bibfile (cdr results)))
    (save-excursion
      (set-buffer (find-file-noselect bibfile))
      (bibtex-search-entry key)
      ;; I like this better than bibtex-url which does not always find
      ;; the urls
      (catch 'done
	(let ((url (bibtex-autokey-get-field "url")))
	  (when  url
	    (browse-url url)
	    (throw 'done nil)))

	(let ((doi (bibtex-autokey-get-field "doi")))
	  (when doi
	    (if (string-match "^http" doi)
		(browse-url doi)
	      (browse-url (format "http://dx.doi.org/%s" doi)))
	    (throw 'done nil)))))
    (set-buffer cb)))


(defun org-ref-open-notes-at-point ()
  "open the notes for bibtex key under point."
  (interactive)
  (let* ((cb (current-buffer))
	 (results (org-ref-get-bibtex-key-and-file))
	 (key (car results))
	 (bibfile (cdr results)))
    (save-excursion
	   (find-file bibfile)
	   (bibtex-search-entry key)
	   (org-ref-open-bibtex-notes))))

(defun org-ref-cite-onclick-minibuffer-menu (&optional link-string)
  "use a minibuffer to select options for the citation under point.

you select your option with a single key press."
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
	 (key (car results))
	 (cb (current-buffer))
         (pdf-file (format (concat org-ref-pdf-directory "%s.pdf") key))
         (bibfile (cdr results))
	 (choice (read-char (org-ref-get-menu-options) )))

    (cond
     ;; open
     ((= choice ?o)
      (find-file bibfile)
       (bibtex-search-entry key))

     ;; cite
     ((= choice ?c)
      (let ((cb (current-buffer)))	
	(message "%s" (progn
			(set-buffer (find-file-noselect bibfile))
			(bibtex-search-entry key)  
			(org-ref-bib-citation)))
	(set-buffer cb)))

     ;; quit
     ((or 
      (= choice ?q) ; q
      (= choice ?\ )) ; space
      ;; this clears the minibuffer
      (message ""))

     ;; pdf
     ((= choice ?p)
      (org-ref-open-pdf-at-point))

     ;; notes
     ((= choice ?n)
      (org-ref-open-notes-at-point))

     ;; url
     ((= choice ?u)
      (org-ref-open-url-at-point))

     ;; anything else we just quit.
     (t (message ""))))
    )

(org-add-link-type
 "cite"
 'org-ref-cite-onclick-minibuffer-menu
 ;; formatting
 (lambda (keyword desc format)
   (cond
    ((eq format 'html) (format "(<cite>%s</cite>)" path))
    ((eq format 'latex)
     (concat "\\cite{"
	     (mapconcat (lambda (key) key) (org-ref-split-and-strip-string keyword) ",")
	     "}")))))

(org-add-link-type
 "citealp"
 'org-ref-cite-onclick-minibuffer-menu
 ;; formatting
 (lambda (keyword desc format)
   (cond
